; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 440458 2 3 2 8 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	thermograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(have_image Phenomenon8 infrared0)
	(have_image Planet9 thermograph1)
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 infrared0)
	(have_image Planet12 thermograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (turn_to satellite0 star2 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
4. (turn_to satellite1 planet9 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet9)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (turn_to satellite1 planet12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet12)
   goals met: 0 of 6
7. (turn_to satellite0 phenomenon8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 6
8. (turn_to satellite1 groundstation4 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 6
9. (take_image satellite0 phenomenon8 instrument0 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 2 of 6
10. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 2 of 6
11. (turn_to satellite0 planet9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet9)
   goals met: 1 of 6
12. (turn_to satellite1 planet12 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet12)
   goals met: 1 of 6
13. (take_image satellite0 planet9 instrument0 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 2 of 6
14. (take_image satellite1 planet12 instrument1 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 3 of 6
15. (turn_to satellite0 phenomenon8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 6
16. (turn_to satellite1 planet11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet11)
   goals met: 4 of 6
17. (take_image satellite1 planet11 instrument1 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 5 of 6
18. (turn_to satellite0 phenomenon10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 6
19. (take_image satellite0 phenomenon10 instrument0 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 5 of 6
20. (turn_to satellite0 phenomenon8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 6
